# Assingment 3

# Task 01

In [2]:
import pandas as pd 
n={'name':"Waseem Ali",
   'DoB':'2000-10-17',
   'RollNo':'45',
   'marks':'90'
  }
df = pd.Series(n)
type(df)

pandas.core.series.Series

In [3]:
df

name      Waseem Ali
DoB       2000-10-17
RollNo            45
marks             90
dtype: object

# Task 02

In [6]:
m={'player':["Ali","Ahmed","Ali Raza","Amanallah"],
   'runs':["35","30","02","56"],
   'balls':["28","27","03","58"],
   'minutes':["32","24","06","65"],
   'dots':["06","03","01","13"]
  }
d=pd.DataFrame(m)

In [7]:
type(df)

pandas.core.series.Series

In [8]:
d

      player runs balls minutes dots
0        Ali   35    28      32   06
1      Ahmed   30    27      24   03
2   Ali Raza   02    03      06   01
3  Amanallah   56    58      65   13

# (A)

In [9]:
 

d.sort_values('runs')

      player runs balls minutes dots
2   Ali Raza   02    03      06   01
1      Ahmed   30    27      24   03
0        Ali   35    28      32   06
3  Amanallah   56    58      65   13

# ( B)

In [26]:
t =d
t[t['runs'] > '32']

  player runs balls minutes dots
0    abc   35    28      32   06
3    ijk   56    58      65   13